apcountryman/dfp-microchip-atmega/dfp/edc/AT90PWM3.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="AT90PWM3" edc:arch="avr8" edc:procid="0x0000" atdf:architecture="AVR8" atdf:family="megaAVR" edc:hasFreeze="false">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="2.7" edc:maxvoltage="5.5" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true" edc:haschecksum="false">
    <edc:ProgrammingRowSize edc:progop="pgm" edc:nzsize="64"/>
    <edc:ProgrammingRowSize edc:progop="cfg" edc:nzsize="1"/>
    <edc:ProgrammingRowSize edc:progop="eedata" edc:nzsize="4"/>
  </edc:Programming>
  <edc:ArchDef edc:name="avr8" edc:desc="avr8">
    <edc:MemTraits>
      <edc:ProgramMemTraits edc:addrinc="0x1" edc:locsize="0x2" edc:wordimpl="0xFFFF" edc:wordinit="0xFFFF" edc:wordsafe="0xFFFF" edc:wordsize="0xFFFF"/>
      <edc:DataMemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFF" edc:wordinit="0xFF" edc:wordsafe="0xFF" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0x810000"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="avr8">
    <edc:InstructionSet edc:instructionsetid="avr8base"/>
    <edc:InstructionSet edc:instructionsetid="avr8brk"/>
    <edc:InstructionSet edc:instructionsetid="avr8movw"/>
    <edc:InstructionSet edc:instructionsetid="avr8lpm"/>
    <edc:InstructionSet edc:instructionsetid="avr8lpmx"/>
    <edc:InstructionSet edc:instructionsetid="avr8sram"/>
    <edc:InstructionSet edc:instructionsetid="avr8mul"/>
    <edc:InstructionSet edc:instructionsetid="avr8spm"/>
  </edc:InstructionSet>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="0" edc:cname="RESET" edc:desc="External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset"/>
    <edc:Interrupt edc:irq="1" edc:cname="PSC2_CAPT" edc:desc="PSC2 Capture Event"/>
    <edc:Interrupt edc:irq="2" edc:cname="PSC2_EC" edc:desc="PSC2 End Cycle"/>
    <edc:Interrupt edc:irq="3" edc:cname="PSC1_CAPT" edc:desc="PSC1 Capture Event"/>
    <edc:Interrupt edc:irq="4" edc:cname="PSC1_EC" edc:desc="PSC1 End Cycle"/>
    <edc:Interrupt edc:irq="5" edc:cname="PSC0_CAPT" edc:desc="PSC0 Capture Event"/>
    <edc:Interrupt edc:irq="6" edc:cname="PSC0_EC" edc:desc="PSC0 End Cycle"/>
    <edc:Interrupt edc:irq="7" edc:cname="ANALOG_COMP_0" edc:desc="Analog Comparator 0"/>
    <edc:Interrupt edc:irq="8" edc:cname="ANALOG_COMP_1" edc:desc="Analog Comparator 1"/>
    <edc:Interrupt edc:irq="9" edc:cname="ANALOG_COMP_2" edc:desc="Analog Comparator 2"/>
    <edc:Interrupt edc:irq="10" edc:cname="INT0" edc:desc="External Interrupt Request 0"/>
    <edc:Interrupt edc:irq="11" edc:cname="TIMER1_CAPT" edc:desc="Timer/Counter1 Capture Event"/>
    <edc:Interrupt edc:irq="12" edc:cname="TIMER1_COMPA" edc:desc="Timer/Counter1 Compare Match A"/>
    <edc:Interrupt edc:irq="13" edc:cname="TIMER1_COMPB" edc:desc="Timer/Counter Compare Match B"/>
    <edc:Interrupt edc:irq="14" edc:cname="RESERVED15" edc:desc=""/>
    <edc:Interrupt edc:irq="15" edc:cname="TIMER1_OVF" edc:desc="Timer/Counter1 Overflow"/>
    <edc:Interrupt edc:irq="16" edc:cname="TIMER0_COMPA" edc:desc="Timer/Counter0 Compare Match A"/>
    <edc:Interrupt edc:irq="17" edc:cname="TIMER0_OVF" edc:desc="Timer/Counter0 Overflow"/>
    <edc:Interrupt edc:irq="18" edc:cname="ADC" edc:desc="ADC Conversion Complete"/>
    <edc:Interrupt edc:irq="19" edc:cname="INT1" edc:desc="External Interrupt Request 1"/>
    <edc:Interrupt edc:irq="20" edc:cname="SPI_STC" edc:desc="SPI Serial Transfer Complete"/>
    <edc:Interrupt edc:irq="21" edc:cname="USART_RX" edc:desc="USART, Rx Complete"/>
    <edc:Interrupt edc:irq="22" edc:cname="USART_UDRE" edc:desc="USART Data Register Empty"/>
    <edc:Interrupt edc:irq="23" edc:cname="USART_TX" edc:desc="USART, Tx Complete"/>
    <edc:Interrupt edc:irq="24" edc:cname="INT2" edc:desc="External Interrupt Request 2"/>
    <edc:Interrupt edc:irq="25" edc:cname="WDT" edc:desc="Watchdog Timeout Interrupt"/>
    <edc:Interrupt edc:irq="26" edc:cname="EE_READY" edc:desc="EEPROM Ready"/>
    <edc:Interrupt edc:irq="27" edc:cname="TIMER0_COMPB" edc:desc="Timer Counter 0 Compare Match B"/>
    <edc:Interrupt edc:irq="28" edc:cname="INT3" edc:desc="External Interrupt Request 3"/>
    <edc:Interrupt edc:irq="29" edc:cname="RESERVED30" edc:desc=""/>
    <edc:Interrupt edc:irq="30" edc:cname="RESERVED31" edc:desc=""/>
    <edc:Interrupt edc:irq="31" edc:cname="SPM_READY" edc:desc="Store Program Memory Read"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="PORTB" edc:desc="I/O Port"/>
    <edc:Peripheral edc:cname="PORTC" edc:desc="I/O Port"/>
    <edc:Peripheral edc:cname="PORTD" edc:desc="I/O Port"/>
    <edc:Peripheral edc:cname="PORTE" edc:desc="I/O Port"/>
    <edc:Peripheral edc:cname="BOOT_LOAD" edc:desc="Bootloader"/>
    <edc:Peripheral edc:cname="EUSART" edc:desc="Extended USART"/>
    <edc:Peripheral edc:cname="AC" edc:desc="Analog Comparator"/>
    <edc:Peripheral edc:cname="DAC" edc:desc="Digital-to-Analog Converter"/>
    <edc:Peripheral edc:cname="CPU" edc:desc="CPU Registers"/>
    <edc:Peripheral edc:cname="TC0" edc:desc="Timer/Counter, 8-bit"/>
    <edc:Peripheral edc:cname="TC1" edc:desc="Timer/Counter, 16-bit"/>
    <edc:Peripheral edc:cname="ADC" edc:desc="Analog-to-Digital Converter"/>
    <edc:Peripheral edc:cname="USART" edc:desc="USART"/>
    <edc:Peripheral edc:cname="SPI" edc:desc="Serial Peripheral Interface"/>
    <edc:Peripheral edc:cname="WDT" edc:desc="Watchdog Timer"/>
    <edc:Peripheral edc:cname="EXINT" edc:desc="External Interrupts"/>
    <edc:Peripheral edc:cname="EEPROM" edc:desc="EEPROM"/>
    <edc:Peripheral edc:cname="PSC0" edc:desc="Power Stage Controller"/>
    <edc:Peripheral edc:cname="PSC1" edc:desc="Power Stage Controller"/>
    <edc:Peripheral edc:cname="PSC2" edc:desc="Power Stage Controller"/>
    <edc:Peripheral edc:cname="FUSE" edc:desc="Fuses"/>
    <edc:Peripheral edc:cname="LOCKBIT" edc:desc="Lockbits"/>
  </edc:PeripheralList>
  <edc:ProgramSpace>
    <edc:CodeSector edc:regionid="IFLASH" edc:beginaddr="0x0" edc:endaddr="0x1000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:CodeSector edc:regionid="BOOT_SECTION_1" edc:beginaddr="0xF80" edc:endaddr="0x1000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:CodeSector edc:regionid="BOOT_SECTION_2" edc:beginaddr="0xF00" edc:endaddr="0x1000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:CodeSector edc:regionid="BOOT_SECTION_3" edc:beginaddr="0xE00" edc:endaddr="0x1000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:CodeSector edc:regionid="BOOT_SECTION_4" edc:beginaddr="0xC00" edc:endaddr="0x1000" atdf:pagesize="0x40" edc:rw="rw"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:magicoffset="0x800000">
    <edc:RegardlessOfMode>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:SFRDef edc:nzwidth="0x10" edc:cname="PC" edc:impl="0xFFFF" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:desc="Program Counter" edc:nmmrid="60"/>
      </edc:NMMRPlace>
      <edc:SFRDataSector edc:regionid="REGISTERS" edc:beginaddr="0x0" edc:endaddr="0x20">
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R0" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x0"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R1" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R2" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x2"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R3" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x3"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R4" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x4"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R5" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x5"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R6" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x6"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R7" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x7"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R8" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x8"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R9" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x9"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R10" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0xA"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R11" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0xB"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R12" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0xC"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R13" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0xD"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R14" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0xE"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R15" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0xF"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R16" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x10"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R17" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x11"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R18" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x12"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R19" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x13"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R20" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x14"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R21" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x15"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R22" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x16"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R23" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x17"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R24" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x18"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R25" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x19"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R26" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1A"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R27" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1B"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R28" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1C"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R29" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1D"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R30" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1E"/>
        <edc:SFRDef edc:nzwidth="0x8" edc:cname="R31" edc:impl="0xFF" edc:access="nnnnnnnn" edc:por="xxxxxxxx" edc:mclr="xxxxxxxx" edc:desc="General-Purpose Register" edc:_addr="0x1F"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:regionid="MAPPED_IO" edc:beginaddr="0x20" edc:endaddr="0x100">
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x20"/>
        <edc:SFRDef ltx:memberofperipheral="PORTB" edc:cname="PINB" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x23"/>
        <edc:SFRDef ltx:memberofperipheral="PORTB" edc:cname="DDRB" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x24"/>
        <edc:SFRDef ltx:memberofperipheral="PORTB" edc:cname="PORTB" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x25"/>
        <edc:SFRDef ltx:memberofperipheral="PORTC" edc:cname="PINC" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x26"/>
        <edc:SFRDef ltx:memberofperipheral="PORTC" edc:cname="DDRC" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x27"/>
        <edc:SFRDef ltx:memberofperipheral="PORTC" edc:cname="PORTC" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x28"/>
        <edc:SFRDef ltx:memberofperipheral="PORTD" edc:cname="PIND" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x29"/>
        <edc:SFRDef ltx:memberofperipheral="PORTD" edc:cname="DDRD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x2A"/>
        <edc:SFRDef ltx:memberofperipheral="PORTD" edc:cname="PORTD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x2B"/>
        <edc:SFRDef ltx:memberofperipheral="PORTE" edc:cname="PINE" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x2C"/>
        <edc:SFRDef ltx:memberofperipheral="PORTE" edc:cname="DDRE" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x2D"/>
        <edc:SFRDef ltx:memberofperipheral="PORTE" edc:cname="PORTE" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0x2E"/>
        <edc:AdjustPoint edc:offset="0x6" edc:_addr="0x2F"/>
        <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TIFR0" edc:nzwidth="0x8" edc:access="-----nnn" edc:impl="0x7" edc:_addr="0x35">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
              <edc:SFRFieldDef edc:cname="TOV0" edc:nzwidth="0x1" edc:desc="Timer/Counter0 Overflow Flag"/>
              <edc:SFRFieldDef edc:cname="OCF0A" edc:nzwidth="0x1" edc:desc="Timer/Counter0 Output Compare Flag 0A"/>
              <edc:SFRFieldDef edc:cname="OCF0B" edc:nzwidth="0x1" edc:desc="Timer/Counter0 Output Compare Flag 0B"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
