apcountryman/dfp-microchip-atmega/dfp/edc/AT90PWM3.PIC
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PIFR1" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:impl="0x3F" edc:_addr="0xA2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:SFRFieldDef edc:cname="PEOP1" edc:nzwidth="0x1" edc:desc="End of PSC1 Interrupt"/>
              <edc:SFRFieldDef edc:cname="PRN1" edc:nzwidth="0x2" edc:desc="Ramp Number">
                <edc:SFRFieldSemantic edc:cname="1" edc:desc="1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="2" edc:desc="2" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="3" edc:desc="3" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="4" edc:desc="4" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PEV1A" edc:nzwidth="0x1" edc:desc="External Event A Interrupt"/>
              <edc:SFRFieldDef edc:cname="PEV1B" edc:nzwidth="0x1" edc:desc="External Event B Interrupt"/>
              <edc:SFRFieldDef edc:cname="PSEI1" edc:nzwidth="0x1" edc:desc="PSC 1 Synchro Error Interrupt"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PIM1" edc:nzwidth="0x8" edc:access="--nnn--n" edc:impl="0x39" edc:_addr="0xA3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:SFRFieldDef edc:cname="PEOPE1" edc:nzwidth="0x1" edc:desc="End of Cycle Interrupt Enable"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PEVE1A" edc:nzwidth="0x1" edc:desc="External Event A Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="PEVE1B" edc:nzwidth="0x1" edc:desc="External Event B Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="PSEIE1" edc:nzwidth="0x1" edc:desc="PSC 1 Synchro Error Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="PIFR2" edc:nzwidth="0x8" edc:access="--nnnnnn" edc:impl="0x3F" edc:_addr="0xA4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="PEOP2" edc:nzwidth="0x1" edc:desc="End of PSC2 Interrupt"/>
              <edc:SFRFieldDef edc:cname="PRN2" edc:nzwidth="0x2" edc:desc="Ramp Number">
                <edc:SFRFieldSemantic edc:cname="1" edc:desc="1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="2" edc:desc="2" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="3" edc:desc="3" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="4" edc:desc="4" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PEV2A" edc:nzwidth="0x1" edc:desc="External Event A Interrupt"/>
              <edc:SFRFieldDef edc:cname="PEV2B" edc:nzwidth="0x1" edc:desc="External Event B Interrupt"/>
              <edc:SFRFieldDef edc:cname="PSEI2" edc:nzwidth="0x1" edc:desc="PSC 2 Synchro Error Interrupt"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="PIM2" edc:nzwidth="0x8" edc:access="--nnn--n" edc:impl="0x39" edc:_addr="0xA5">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="PEOPE2" edc:nzwidth="0x1" edc:desc="End of Cycle Interrupt Enable"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PEVE2A" edc:nzwidth="0x1" edc:desc="External Event A Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="PEVE2B" edc:nzwidth="0x1" edc:desc="External Event B Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="PSEIE2" edc:nzwidth="0x1" edc:desc="PSC 2 Synchro Error Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xA6"/>
        <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DACON" edc:nzwidth="0x8" edc:access="nnnn-nnn" edc:impl="0xF7" edc:_addr="0xAA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
              <edc:SFRFieldDef edc:cname="DAEN" edc:nzwidth="0x1" edc:desc="DAC Enable Bit"/>
              <edc:SFRFieldDef edc:cname="DAOE" edc:nzwidth="0x1" edc:desc="DAC Output Enable"/>
              <edc:SFRFieldDef edc:cname="DALA" edc:nzwidth="0x1" edc:desc="DAC Left Adjust"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="DATS" edc:nzwidth="0x3" edc:desc="DAC Trigger Selection Bits">
                <edc:SFRFieldSemantic edc:cname="ANALOG_COMPARATOR_0" edc:desc="Analog Comparator 0" edc:when="(field &amp; 0x7) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="ANALOG_COMPARATOR_1" edc:desc="Analog Comparator 1" edc:when="(field &amp; 0x7) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="EXTERNAL_INTERRUPT_REQUEST_0" edc:desc="External Interrupt Request 0" edc:when="(field &amp; 0x7) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="TIMER_COUNTER0_COMPARE_MATCH_A" edc:desc="Timer/Counter0 Compare Match A" edc:when="(field &amp; 0x7) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="TIMER_COUNTER0_OVERFLOW" edc:desc="Timer/Counter0 Overflow" edc:when="(field &amp; 0x7) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="TIMER_COUNTER1_COMPARE_MATCH_B" edc:desc="Timer/Counter1 Compare Match B" edc:when="(field &amp; 0x7) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="TIMER_COUNTER1_OVERFLOW" edc:desc="Timer/Counter1 Overflow" edc:when="(field &amp; 0x7) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="TIMER_COUNTER1_CAPTURE_EVENT" edc:desc="Timer/Counter1 Capture Event" edc:when="(field &amp; 0x7) == 0x07"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="DAATE" edc:nzwidth="0x1" edc:desc="DAC Auto Trigger Enable Bit"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="DAC" edc:cname="DAC" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xAB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DAC">
              <edc:SFRFieldDef edc:cname="DAC" edc:nzwidth="0x10" edc:desc="DAC Data Register Bits"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
