apcountryman/dfp-microchip-atmega/dfp/edc/AT90PWM3.PIC
        <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="AC0CON" edc:nzwidth="0x8" edc:access="nnnn-nnn" edc:impl="0xF7" edc:_addr="0xAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
              <edc:SFRFieldDef edc:cname="AC0M" edc:nzwidth="0x3" edc:desc="Analog Comparator 0 Multiplexer Register"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC0IS" edc:nzwidth="0x2" edc:desc="Analog Comparator 0  Interrupt Select Bit"/>
              <edc:SFRFieldDef edc:cname="AC0IE" edc:nzwidth="0x1" edc:desc="Analog Comparator 0 Interrupt Enable Bit"/>
              <edc:SFRFieldDef edc:cname="AC0EN" edc:nzwidth="0x1" edc:desc="Analog Comparator 0 Enable Bit"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="AC1CON" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xAE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
              <edc:SFRFieldDef edc:cname="AC1M" edc:nzwidth="0x3" edc:desc="Analog Comparator 1 Multiplexer Register"/>
              <edc:SFRFieldDef edc:cname="AC1ICE" edc:nzwidth="0x1" edc:desc="Analog Comparator 1 Interrupt Capture Enable Bit"/>
              <edc:SFRFieldDef edc:cname="AC1IS" edc:nzwidth="0x2" edc:desc="Analog Comparator 1  Interrupt Select Bit">
                <edc:SFRFieldSemantic edc:cname="INTERRUPT_ON_TOGGLE" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="INTERRUPT_ON_FALLING_EDGE" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="INTERRUPT_ON_RISING_EDGE" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC1IE" edc:nzwidth="0x1" edc:desc="Analog Comparator 1 Interrupt Enable Bit"/>
              <edc:SFRFieldDef edc:cname="AC1EN" edc:nzwidth="0x1" edc:desc="Analog Comparator 1 Enable Bit"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="AC2CON" edc:nzwidth="0x8" edc:access="nnnn-nnn" edc:impl="0xF7" edc:_addr="0xAF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
              <edc:SFRFieldDef edc:cname="AC2M" edc:nzwidth="0x3" edc:desc="Analog Comparator 2 Multiplexer Register"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2IS" edc:nzwidth="0x2" edc:desc="Analog Comparator 2  Interrupt Select Bit">
                <edc:SFRFieldSemantic edc:cname="INTERRUPT_ON_TOGGLE" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="INTERRUPT_ON_FALLING_EDGE" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="INTERRUPT_ON_RISING_EDGE" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC2IE" edc:nzwidth="0x1" edc:desc="Analog Comparator 2 Interrupt Enable Bit"/>
              <edc:SFRFieldDef edc:cname="AC2EN" edc:nzwidth="0x1" edc:desc="Analog Comparator 2 Enable Bit"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x10" edc:_addr="0xB0"/>
        <edc:SFRDef ltx:memberofperipheral="USART" edc:cname="UCSRA" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xC0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
              <edc:SFRFieldDef edc:cname="MPCM" edc:nzwidth="0x1" edc:desc="Multi-processor Communication Mode"/>
              <edc:SFRFieldDef edc:cname="U2X" edc:nzwidth="0x1" edc:desc="Double USART Transmission Bit"/>
              <edc:SFRFieldDef edc:cname="UPE" edc:nzwidth="0x1" edc:desc="USART Parity Error"/>
              <edc:SFRFieldDef edc:cname="DOR" edc:nzwidth="0x1" edc:desc="Data Overrun"/>
              <edc:SFRFieldDef edc:cname="FE" edc:nzwidth="0x1" edc:desc="Framing Error"/>
              <edc:SFRFieldDef edc:cname="UDRE" edc:nzwidth="0x1" edc:desc="USART Data Register Empty"/>
              <edc:SFRFieldDef edc:cname="TXC" edc:nzwidth="0x1" edc:desc="USART Transmit Complete"/>
              <edc:SFRFieldDef edc:cname="RXC" edc:nzwidth="0x1" edc:desc="USART Receive Complete"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART" edc:cname="UCSRB" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xC1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
              <edc:SFRFieldDef edc:cname="TXB8" edc:nzwidth="0x1" edc:desc="Transmit Data Bit 8"/>
              <edc:SFRFieldDef edc:cname="RXB8" edc:nzwidth="0x1" edc:desc="Receive Data Bit 8"/>
              <edc:SFRFieldDef edc:cname="UCSZ2" edc:nzwidth="0x1" edc:desc="Character Size"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmitter Enable"/>
              <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enable"/>
              <edc:SFRFieldDef edc:cname="UDRIE" edc:nzwidth="0x1" edc:desc="USART Data Register Empty Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="TXCIE" edc:nzwidth="0x1" edc:desc="TX Complete Interrupt Enable"/>
              <edc:SFRFieldDef edc:cname="RXCIE" edc:nzwidth="0x1" edc:desc="RX Complete Interrupt Enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART" edc:cname="UCSRC" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:impl="0x7F" edc:_addr="0xC2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
              <edc:SFRFieldDef edc:cname="UCPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity"/>
              <edc:SFRFieldDef edc:cname="UCSZ" edc:nzwidth="0x2" edc:desc="Character Size Bits"/>
              <edc:SFRFieldDef edc:cname="USBS" edc:nzwidth="0x1" edc:desc="Stop Bit Select">
                <edc:SFRFieldSemantic edc:cname="1_BIT" edc:desc="1-bit" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="2_BIT" edc:desc="2-bit" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UPM" edc:nzwidth="0x2" edc:desc="Parity Mode Bits">
                <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ENABLED_EVEN_PARITY" edc:desc="Enabled, Even Parity" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="ENABLED_ODD_PARITY" edc:desc="Enabled, Odd Parity" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UMSEL0" edc:nzwidth="0x1" edc:desc="USART Mode Select"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xC3"/>
        <edc:SFRDef ltx:memberofperipheral="USART" edc:cname="UBRR" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xC4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
              <edc:SFRFieldDef edc:cname="UBRR" edc:nzwidth="0xC" edc:desc="USART Baud Rate Register Bits"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="USART" edc:cname="UDR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xC6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART">
              <edc:SFRFieldDef edc:cname="UDR" edc:nzwidth="0x8" edc:desc="USART I/O Data"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xC7"/>
        <edc:SFRDef ltx:memberofperipheral="EUSART" edc:cname="EUCSRA" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xC8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EUSART">
              <edc:SFRFieldDef edc:cname="URxS" edc:nzwidth="0x4" edc:desc="EUSART Control and Status Register A Bits">
                <edc:SFRFieldSemantic edc:cname="5_BIT" edc:desc="5-bit" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="6_BIT" edc:desc="6-bit" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="7_BIT" edc:desc="7-bit" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8-bit" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9-bit" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="13_BIT" edc:desc="13-bit" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="14_BIT" edc:desc="14-bit" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="15_BIT" edc:desc="15-bit" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="16_BIT" edc:desc="16-bit" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="16_OR_17" edc:desc="16 or 17" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="17_BIT" edc:desc="17-bit" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="UTxS" edc:nzwidth="0x4" edc:desc="EUSART Control and Status Register A Bits">
                <edc:SFRFieldSemantic edc:cname="5_BIT" edc:desc="5-bit" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="6_BIT" edc:desc="6-bit" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="7_BIT" edc:desc="7-bit" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8-bit" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9-bit" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="13_BIT" edc:desc="13-bit" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="14_BIT" edc:desc="14-bit" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="15_BIT" edc:desc="15-bit" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="16_BIT" edc:desc="16-bit" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED" edc:desc="Reserved" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="17_BIT" edc:desc="17-bit" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="EUSART" edc:cname="EUCSRB" edc:nzwidth="0x8" edc:access="---nn-nn" edc:impl="0x1B" edc:_addr="0xC9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EUSART">
              <edc:SFRFieldDef edc:cname="BODR" edc:nzwidth="0x1" edc:desc="Order Bit"/>
              <edc:SFRFieldDef edc:cname="EMCH" edc:nzwidth="0x1" edc:desc="Manchester Mode Bit"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EUSBS" edc:nzwidth="0x1" edc:desc="EUSBS Enable Bit"/>
              <edc:SFRFieldDef edc:cname="EUSART" edc:nzwidth="0x1" edc:desc="EUSART Enable Bit"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
