apcountryman/dfp-microchip-atmega/dfp/edc/AT90PWM3.PIC
        <edc:SFRDef ltx:memberofperipheral="EUSART" edc:cname="EUCSRC" edc:nzwidth="0x8" edc:access="----nnnn" edc:impl="0xF" edc:_addr="0xCA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EUSART">
              <edc:SFRFieldDef edc:cname="STP" edc:nzwidth="0x2" edc:desc="Stop Bits"/>
              <edc:SFRFieldDef edc:cname="F1617" edc:nzwidth="0x1" edc:desc="F1617 Bit"/>
              <edc:SFRFieldDef edc:cname="FEM" edc:nzwidth="0x1" edc:desc="Frame Error Manchester Bit"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xCB"/>
        <edc:SFRDef ltx:memberofperipheral="EUSART" edc:cname="MUBRR" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xCC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EUSART">
              <edc:SFRFieldDef edc:cname="MUBRR" edc:nzwidth="0x10" edc:desc="Manchester Receiver Baud Rate Register Bits"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="EUSART" edc:cname="EUDR" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xCE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EUSART">
              <edc:SFRFieldDef edc:cname="EUDR" edc:nzwidth="0x8" edc:desc="EUSART Extended data bits"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xCF"/>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="PSOC0" edc:nzwidth="0x8" edc:access="--nn-n-n" edc:impl="0x35" edc:_addr="0xD0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="POEN0A" edc:nzwidth="0x1" edc:desc="PSCOUT00 Output Enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN0B" edc:nzwidth="0x1" edc:desc="PSCOUT01 Output Enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC0" edc:nzwidth="0x2" edc:desc="Synchronization Out for ADC Selection">
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN0" edc:desc="Send signal on leading edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN0" edc:desc="Send signal on trailing edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN1" edc:desc="Send signal on leading edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN1" edc:desc="Send signal on trailing edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xD1"/>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="OCR0SA" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xD2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="OCR0SA" edc:nzwidth="0xC" edc:desc="Output Compare SA"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="OCR0RA" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xD4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="OCR0RA" edc:nzwidth="0xC" edc:desc="Output Compare RA"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="OCR0SB" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xD6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="OCR0SB" edc:nzwidth="0xC" edc:desc="Output Compare SB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="OCR0RB" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xD8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="OCR0RB" edc:nzwidth="0x10" edc:desc="Output Compare RB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="PCNF0" edc:nzwidth="0x8" edc:access="nnnnnnn-" edc:impl="0xFE" edc:_addr="0xDA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL0" edc:nzwidth="0x1" edc:desc="PSC 0 Input Clock Select"/>
              <edc:SFRFieldDef edc:cname="POP0" edc:nzwidth="0x1" edc:desc="PSC 0 Output Polarity"/>
              <edc:SFRFieldDef edc:cname="PMODE0" edc:nzwidth="0x2" edc:desc="PSC 0 Mode">
                <edc:SFRFieldSemantic edc:cname="ONE_RAMP_MODE" edc:desc="One Ramp Mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TWO_RAMP_MODE" edc:desc="Two Ramp Mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FOUR_RAMP_MODE" edc:desc="Four Ramp Mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CENTER_ALIGNED_MODE" edc:desc="Center Aligned Mode" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PLOCK0" edc:nzwidth="0x1" edc:desc="PSC 0 Lock"/>
              <edc:SFRFieldDef edc:cname="PALOCK0" edc:nzwidth="0x1" edc:desc="PSC 0 Autolock"/>
              <edc:SFRFieldDef edc:cname="PFIFTY0" edc:nzwidth="0x1" edc:desc="PSC 0 Fifty"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="PCTL0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xDB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="PRUN0" edc:nzwidth="0x1" edc:desc="PSC 0 Run"/>
              <edc:SFRFieldDef edc:cname="PCCYC0" edc:nzwidth="0x1" edc:desc="PSC0 Complete Cycle"/>
              <edc:SFRFieldDef edc:cname="PARUN0" edc:nzwidth="0x1" edc:desc="PSC0 Auto Run"/>
              <edc:SFRFieldDef edc:cname="PAOC0A" edc:nzwidth="0x1" edc:desc="PSC 0 Asynchronous Output Control A"/>
              <edc:SFRFieldDef edc:cname="PAOC0B" edc:nzwidth="0x1" edc:desc="PSC 0 Asynchronous Output Control B"/>
              <edc:SFRFieldDef edc:cname="PBFM0" edc:nzwidth="0x1" edc:desc="PSC 0 Balance Flank Width Modulation"/>
              <edc:SFRFieldDef edc:cname="PPRE0" edc:nzwidth="0x2" edc:desc="PSC 0 Prescaler Selects">
                <edc:SFRFieldSemantic edc:cname="NO_DIVIDER_ON_PSC_INPUT_CLOCK" edc:desc="No divider on PSC input clock" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_4" edc:desc="Divide the PSC input clock by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_16" edc:desc="Divide the PSC input clock by 16" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_64" edc:desc="Divide the PSC input clock by 64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="PFRC0A" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xDC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="PRFM0A" edc:nzwidth="0x4" edc:desc="PSC 0 Retrigger and Fault Mode for Part A">
                <edc:SFRFieldSemantic edc:cname="NO_ACTION_PSC_INPUT_IS_IGNORED" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_AND_INSERT_DEAD_TIME" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGE_RETRIGGER_PSC" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT" edc:desc="Fixed Frequency Edge Retrigger PSC and Deactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE0A" edc:nzwidth="0x1" edc:desc="PSC 0 Filter Enable on Input Part A"/>
              <edc:SFRFieldDef edc:cname="PELEV0A" edc:nzwidth="0x1" edc:desc="PSC 0 Edge Level Selector on Input Part A"/>
              <edc:SFRFieldDef edc:cname="PISEL0A" edc:nzwidth="0x1" edc:desc="PSC 0 Input Select for Part A"/>
              <edc:SFRFieldDef edc:cname="PCAE0A" edc:nzwidth="0x1" edc:desc="PSC 0 Capture Enable Input Part A"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="PFRC0B" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xDD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="PRFM0B" edc:nzwidth="0x4" edc:desc="PSC 0 Retrigger and Fault Mode for Part B">
                <edc:SFRFieldSemantic edc:cname="NO_ACTION_PSC_INPUT_IS_IGNORED" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_AND_INSERT_DEAD_TIME" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGE_RETRIGGER_PSC" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT" edc:desc="Fixed Frequency Edge Retrigger PSC and Deactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE0B" edc:nzwidth="0x1" edc:desc="PSC 0 Filter Enable on Input Part B"/>
              <edc:SFRFieldDef edc:cname="PELEV0B" edc:nzwidth="0x1" edc:desc="PSC 0 Edge Level Selector on Input Part B"/>
              <edc:SFRFieldDef edc:cname="PISEL0B" edc:nzwidth="0x1" edc:desc="PSC 0 Input Select for Part B"/>
              <edc:SFRFieldDef edc:cname="PCAE0B" edc:nzwidth="0x1" edc:desc="PSC 0 Capture Enable Input Part B"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC0" edc:cname="PICR0" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xDE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC0">
              <edc:SFRFieldDef edc:cname="PICR0" edc:nzwidth="0xC" edc:desc="PSC 0 Input Capture Bytes"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PSOC1" edc:nzwidth="0x8" edc:access="--nn-n-n" edc:impl="0x35" edc:_addr="0xE0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:SFRFieldDef edc:cname="POEN1A" edc:nzwidth="0x1" edc:desc="PSCOUT10 Output Enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN1B" edc:nzwidth="0x1" edc:desc="PSCOUT11 Output Enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PSYNC1_" edc:nzwidth="0x2" edc:desc="Synchronization Out for ADC Selection">
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN0" edc:desc="Send signal on leading edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN0" edc:desc="Send signal on trailing edge of PSCOUTn0" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_LEADING_EDGE_OF_PSCOUTN1" edc:desc="Send signal on leading edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="SEND_SIGNAL_ON_TRAILING_EDGE_OF_PSCOUTN1" edc:desc="Send signal on trailing edge of PSCOUTn1" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0xE1"/>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="OCR1SA" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xE2"/>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="OCR1RA" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xE4"/>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="OCR1SB" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xE6"/>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="OCR1RB" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xE8"/>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PCNF1" edc:nzwidth="0x8" edc:access="nnnnnnn-" edc:impl="0xFE" edc:_addr="0xEA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL1" edc:nzwidth="0x1" edc:desc="PSC 1 Input Clock Select"/>
              <edc:SFRFieldDef edc:cname="POP1" edc:nzwidth="0x1" edc:desc="PSC 1 Output Polarity"/>
              <edc:SFRFieldDef edc:cname="PMODE1" edc:nzwidth="0x2" edc:desc="PSC 1 Mode">
                <edc:SFRFieldSemantic edc:cname="ONE_RAMP_MODE" edc:desc="One Ramp Mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TWO_RAMP_MODE" edc:desc="Two Ramp Mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FOUR_RAMP_MODE" edc:desc="Four Ramp Mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CENTER_ALIGNED_MODE" edc:desc="Center Aligned Mode" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PLOCK1" edc:nzwidth="0x1" edc:desc="PSC 1 Lock"/>
              <edc:SFRFieldDef edc:cname="PALOCK1" edc:nzwidth="0x1" edc:desc="PSC 1 Autolock"/>
              <edc:SFRFieldDef edc:cname="PFIFTY1" edc:nzwidth="0x1" edc:desc="PSC 1 Fifty"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PCTL1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xEB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:SFRFieldDef edc:cname="PRUN1" edc:nzwidth="0x1" edc:desc="PSC 1 Run"/>
              <edc:SFRFieldDef edc:cname="PCCYC1" edc:nzwidth="0x1" edc:desc="PSC1 Complete Cycle"/>
              <edc:SFRFieldDef edc:cname="PARUN1" edc:nzwidth="0x1" edc:desc="PSC1 Auto Run"/>
              <edc:SFRFieldDef edc:cname="PAOC1A" edc:nzwidth="0x1" edc:desc="PSC 1 Asynchronous Output Control A"/>
              <edc:SFRFieldDef edc:cname="PAOC1B" edc:nzwidth="0x1" edc:desc="PSC 1 Asynchronous Output Control B"/>
              <edc:SFRFieldDef edc:cname="PBFM1" edc:nzwidth="0x1" edc:desc="Balance Flank Width Modulation"/>
              <edc:SFRFieldDef edc:cname="PPRE1" edc:nzwidth="0x2" edc:desc="PSC 1 Prescaler Selects">
                <edc:SFRFieldSemantic edc:cname="NO_DIVIDER_ON_PSC_INPUT_CLOCK" edc:desc="No divider on PSC input clock" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_4" edc:desc="Divide the PSC input clock by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_16" edc:desc="Divide the PSC input clock by 16" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_64" edc:desc="Divide the PSC input clock by 64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
