apcountryman/dfp-microchip-atmega/dfp/edc/AT90PWM3.PIC
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PFRC1A" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xEC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:SFRFieldDef edc:cname="PRFM1A" edc:nzwidth="0x4" edc:desc="PSC 1 Retrigger and Fault Mode for Part A">
                <edc:SFRFieldSemantic edc:cname="NO_ACTION_PSC_INPUT_IS_IGNORED" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_AND_INSERT_DEAD_TIME" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGE_RETRIGGER_PSC" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT" edc:desc="Fixed Frequency Edge Retrigger PSC and Deactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE1A" edc:nzwidth="0x1" edc:desc="PSC 1 Filter Enable on Input Part A"/>
              <edc:SFRFieldDef edc:cname="PELEV1A" edc:nzwidth="0x1" edc:desc="PSC 1 Edge Level Selector on Input Part A"/>
              <edc:SFRFieldDef edc:cname="PISEL1A" edc:nzwidth="0x1" edc:desc="PSC 1 Input Select for Part A"/>
              <edc:SFRFieldDef edc:cname="PCAE1A" edc:nzwidth="0x1" edc:desc="PSC 1 Capture Enable Input Part A"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PFRC1B" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xED">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC1">
              <edc:SFRFieldDef edc:cname="PRFM1B" edc:nzwidth="0x4" edc:desc="PSC 1 Retrigger and Fault Mode for Part B">
                <edc:SFRFieldSemantic edc:cname="NO_ACTION_PSC_INPUT_IS_IGNORED" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_AND_INSERT_DEAD_TIME" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGE_RETRIGGER_PSC" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT" edc:desc="Fixed Frequency Edge Retrigger PSC and Deactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE1B" edc:nzwidth="0x1" edc:desc="PSC 1 Filter Enable on Input Part B"/>
              <edc:SFRFieldDef edc:cname="PELEV1B" edc:nzwidth="0x1" edc:desc="PSC 1 Edge Level Selector on Input Part B"/>
              <edc:SFRFieldDef edc:cname="PISEL1B" edc:nzwidth="0x1" edc:desc="PSC 1 Input Select for Part B"/>
              <edc:SFRFieldDef edc:cname="PCAE1B" edc:nzwidth="0x1" edc:desc="PSC 1 Capture Enable Input Part B"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC1" edc:cname="PICR1" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xEE"/>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="PSOC2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xF0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="POEN2A" edc:nzwidth="0x1" edc:desc="PSCOUT20 Output Enable"/>
              <edc:SFRFieldDef edc:cname="POEN2C" edc:nzwidth="0x1" edc:desc="PSCOUT22 Output Enable"/>
              <edc:SFRFieldDef edc:cname="POEN2B" edc:nzwidth="0x1" edc:desc="PSCOUT21 Output Enable"/>
              <edc:SFRFieldDef edc:cname="POEN2D" edc:nzwidth="0x1" edc:desc="PSCOUT23 Output Enable"/>
              <edc:SFRFieldDef edc:cname="PSYNC2_" edc:nzwidth="0x2" edc:desc="Synchronization Out for ADC Selection"/>
              <edc:SFRFieldDef edc:cname="POS2" edc:nzwidth="0x2" edc:desc="PSC 2 Output 23 Select"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
