apcountryman/dfp-microchip-atmega/dfp/edc/AT90PWM3.PIC
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="POM2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xF1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="POMV2A" edc:nzwidth="0x4" edc:desc="Output Matrix Output A Ramps"/>
              <edc:SFRFieldDef edc:cname="POMV2B" edc:nzwidth="0x4" edc:desc="Output Matrix Output B Ramps"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="OCR2SA" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xF2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="OCR2SA" edc:nzwidth="0xC" edc:desc="Output Compare SA"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="OCR2RA" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xF4">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="OCR2RA" edc:nzwidth="0xC" edc:desc="Output Compare RA"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="OCR2SB" edc:nzwidth="0x10" edc:access="----nnnnnnnnnnnn" edc:impl="0xFFF" edc:_addr="0xF6">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="OCR2SB" edc:nzwidth="0xC" edc:desc="Output Compare SB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="OCR2RB" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xF8">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="OCR2RB" edc:nzwidth="0x10" edc:desc="Output Compare RB"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="PCNF2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xFA">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="POME2" edc:nzwidth="0x1" edc:desc="PSC 2 Output Matrix Enable"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL2" edc:nzwidth="0x1" edc:desc="PSC 2 Input Clock Select"/>
              <edc:SFRFieldDef edc:cname="POP2" edc:nzwidth="0x1" edc:desc="PSC 2 Output Polarity"/>
              <edc:SFRFieldDef edc:cname="PMODE2" edc:nzwidth="0x2" edc:desc="PSC 2 Mode">
                <edc:SFRFieldSemantic edc:cname="ONE_RAMP_MODE" edc:desc="One Ramp Mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TWO_RAMP_MODE" edc:desc="Two Ramp Mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FOUR_RAMP_MODE" edc:desc="Four Ramp Mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CENTER_ALIGNED_MODE" edc:desc="Center Aligned Mode" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PLOCK2" edc:nzwidth="0x1" edc:desc="PSC 2 Lock"/>
              <edc:SFRFieldDef edc:cname="PALOCK2" edc:nzwidth="0x1" edc:desc="PSC 2 Autolock"/>
              <edc:SFRFieldDef edc:cname="PFIFTY2" edc:nzwidth="0x1" edc:desc="PSC 2 Fifty"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="PCTL2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xFB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="PRUN2" edc:nzwidth="0x1" edc:desc="PSC 2 Run"/>
              <edc:SFRFieldDef edc:cname="PCCYC2" edc:nzwidth="0x1" edc:desc="PSC2 Complete Cycle"/>
              <edc:SFRFieldDef edc:cname="PARUN2" edc:nzwidth="0x1" edc:desc="PSC2 Auto Run"/>
              <edc:SFRFieldDef edc:cname="PAOC2A" edc:nzwidth="0x1" edc:desc="PSC 2 Asynchronous Output Control A"/>
              <edc:SFRFieldDef edc:cname="PAOC2B" edc:nzwidth="0x1" edc:desc="PSC 2 Asynchronous Output Control B"/>
              <edc:SFRFieldDef edc:cname="PBFM2" edc:nzwidth="0x1" edc:desc="Balance Flank Width Modulation"/>
              <edc:SFRFieldDef edc:cname="PPRE2" edc:nzwidth="0x2" edc:desc="PSC 2 Prescaler Selects">
                <edc:SFRFieldSemantic edc:cname="NO_DIVIDER_ON_PSC_INPUT_CLOCK" edc:desc="No divider on PSC input clock" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_4" edc:desc="Divide the PSC input clock by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_16" edc:desc="Divide the PSC input clock by 16" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIVIDE_THE_PSC_INPUT_CLOCK_BY_64" edc:desc="Divide the PSC input clock by 64" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="PSC2" edc:cname="PFRC2A" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xFC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PSC2">
              <edc:SFRFieldDef edc:cname="PRFM2A" edc:nzwidth="0x4" edc:desc="PSC 2 Retrigger and Fault Mode for Part A">
                <edc:SFRFieldSemantic edc:cname="NO_ACTION_PSC_INPUT_IS_IGNORED" edc:desc="No action, PSC Input is ignored" edc:when="(field &amp; 0xF) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Execute Opposite Dead-Time and Wait" edc:when="(field &amp; 0xF) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_EXECUTE_OPPOSITE_WHILE_FAULT_ACTIVE" edc:desc="Stop signal, Execute Opposite while Fault active" edc:when="(field &amp; 0xF) == 0x03"/>
                <edc:SFRFieldSemantic edc:cname="DEACTIVATE_OUTPUTS_WITHOUT_CHANGING_TIMING" edc:desc="Deactivate outputs without changing timing." edc:when="(field &amp; 0xF) == 0x04"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_AND_INSERT_DEAD_TIME" edc:desc="Stop signal and Insert Dead-Time" edc:when="(field &amp; 0xF) == 0x05"/>
                <edc:SFRFieldSemantic edc:cname="STOP_SIGNAL_JUMP_TO_OPPOSITE_DEAD_TIME_AND_WAIT" edc:desc="Stop signal, Jump to Opposite Dead-Time and Wait." edc:when="(field &amp; 0xF) == 0x06"/>
                <edc:SFRFieldSemantic edc:cname="HALT_PSC_AND_WAIT_FOR_SOFTWARE_ACTION" edc:desc="Halt PSC and Wait for Software Action" edc:when="(field &amp; 0xF) == 0x07"/>
                <edc:SFRFieldSemantic edc:cname="EDGE_RETRIGGER_PSC" edc:desc="Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x08"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC" edc:desc="Fixed Frequency Edge Retrigger PSC" edc:when="(field &amp; 0xF) == 0x09"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0A"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0B"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0C"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0D"/>
                <edc:SFRFieldSemantic edc:cname="FIXED_FREQUENCY_EDGE_RETRIGGER_PSC_AND_DISACTIVATE_OUTPUT" edc:desc="Fixed Frequency Edge Retrigger PSC and Deactivate Output" edc:when="(field &amp; 0xF) == 0x0E"/>
                <edc:SFRFieldSemantic edc:cname="RESERVED_DO_NOT_USE" edc:desc="Reserved (do not use)" edc:when="(field &amp; 0xF) == 0x0F"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="PFLTE2A" edc:nzwidth="0x1" edc:desc="PSC 2 Filter Enable on Input Part A"/>
              <edc:SFRFieldDef edc:cname="PELEV2A" edc:nzwidth="0x1" edc:desc="PSC 2 Edge Level Selector on Input Part A"/>
              <edc:SFRFieldDef edc:cname="PISEL2A" edc:nzwidth="0x1" edc:desc="PSC 2 Input Select for Part A"/>
              <edc:SFRFieldDef edc:cname="PCAE2A" edc:nzwidth="0x1" edc:desc="PSC 2 Capture Enable Input Part A"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
